#+setupfile: info/index-bigblow-header.setup
#+include: info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+Title: 入門統計学
#+OPTIONS: tex:t 


* script
  
** Todo 調査項目 [0/3]
   - [ ] header argument の有効性
   - [ ] .xlsx の取り込み
     - コンマ付数値
     - 日本語コード
   - [ ] 
     
   
 #+property: header-arg:R :session t :results output :exports both

 #+begin_src R :session t :results output :exports both :tangle Codes/0403.R
 #+end_src

 #+begin_src R ：tangle Codes/01.R :session t
## 入門統計学1章1節


 #+end_src

 #+RESULTS:


* 1章
#+begin_src R ：tangle Codes/01.R :session t :results output
## 入門統計学1章 表1.2.csv
## install.packages("openxlsx")
## library(openxlsx)

(表1.2 <- read.csv("Data/表1.2.csv",fill=TRUE))
class(表1.2)
表1.2

#+end_src

#+RESULTS:
#+begin_example
           表1.2.キュウリの収量
1  ポット番号\t栽培法A\t栽培法B
2               1\t3063\t3157\t
3               2\t2275\t2707\t
4               3\t2089\t3270\t
5               4\t2855\t3181\t
6               5\t2836\t3633\t
7               6\t3219\t3404\t
8               7\t2817\t2219\t
9               8\t2136\t2730\t
10              9\t2540\t3408\t
11             10\t2263\t3203\t
12             11\t2140\t2938\t
13             12\t1757\t3286\t
14             13\t2499\t2920\t
15             14\t2093\t3332\t
16             15\t2073\t3478\t
[1] "data.frame"
           表1.2.キュウリの収量
1  ポット番号\t栽培法A\t栽培法B
2               1\t3063\t3157\t
3               2\t2275\t2707\t
4               3\t2089\t3270\t
5               4\t2855\t3181\t
6               5\t2836\t3633\t
7               6\t3219\t3404\t
8               7\t2817\t2219\t
9               8\t2136\t2730\t
10              9\t2540\t3408\t
11             10\t2263\t3203\t
12             11\t2140\t2938\t
13             12\t1757\t3286\t
14             13\t2499\t2920\t
15             14\t2093\t3332\t
16             15\t2073\t3478\t
#+end_example

#+begin_src R ：tangle Codes/01.R :session t :results output graph
## 入門統計学1章1節
(h <- table(表1.2))

#+end_src

#+RESULTS:
#+begin_example
表1.2
             1\t3063\t3157\t             10\t2263\t3203\t 
                           1                            1 
            11\t2140\t2938\t             12\t1757\t3286\t 
                           1                            1 
            13\t2499\t2920\t             14\t2093\t3332\t 
                           1                            1 
            15\t2073\t3478\t              2\t2275\t2707\t 
                           1                            1 
             3\t2089\t3270\t              4\t2855\t3181\t 
                           1                            1 
             5\t2836\t3633\t              6\t3219\t3404\t 
                           1                            1 
             7\t2817\t2219\t              8\t2136\t2730\t 
                           1                            1 
             9\t2540\t3408\t ポット番号\t栽培法A\t栽培法B 
                           1                            1
#+end_example

#+begin_src R ：tangle Codes/01.R :session t :results output
## 入門統計学1章1節

hist (h)
#+end_src

#+RESULTS:
